/**
 * 隐私政策文本
 */

export const privacyPolicy = `                                        
一、总则
敬请您务必认真阅读和仔细理解本《海龟壹号商城普通经销商服务协议》（以下简称《协议》），除非您完全接受本《协议》约定，否则您无权注册、登录或使用《协议》约定之服务平台。您一经注册、登录或使用《协议》约定之服务平台将视为对本《协议》约定的接受，即表示您完全同意接受本《协议》全部条款的约束。同时，为了维护您及海龟壹号平台的权益，海龟壹号可自行决定更改"条款"，且毋须另行通知。"条款"若有变更，海龟壹号将在网上公告相关信息，更新版本自公告之日起代替原版协议。如您不完全同意本《协议》约定（含后续更新），请勿注册、登录或使用本《协议》约定之服务平台。
二、谁可使用海龟壹号跨境电商平台
本《协议》约定之平台服务仅供根据法律规定可以订立具有法律效力合约的自然人使用。若不符合本项规定，请勿使用本服务平台。
三、收费
海龟壹号保留根据第一条约定收取服务费用的权利，一旦因《协议》生效而产生服务费用时，该会员资格无法变更。您因进行交易、向本公司获取有偿服务或接触本公司服务器而发生的所有应纳税赋以及一切硬件、软件等其他方面的费用均将由您承担。本公司保留在无须发出通知的情况下，暂时或永久地更改或停止部分或全部服务的权利。
四、 账户注册
1.您知悉并同意，为使用海龟壹号在本协议项下提供的海龟壹号商城普通经销商服务，您需按照海龟壹号的要求和规则进行账户注册，并按要求提供相关信息（包括但不限于身份信息/邮箱/电话等）和相关资料。此类信息和资料如有变更，您应及时提供最新、真实、完整的信息。如上述信息和资料欠缺真实、完整或未及时更新，由此造成的全部损失与不利后果由您自行承担，海龟壹号保留终止用户使用海龟壹号平台各项服务的权利，如给海龟壹号平台带来其他损失或行政调查、诉讼纠纷等， 海龟壹号保留进一步追究用户法律责任的权利。
2.用户须具有法定的权利能力和行为能力的自然人，能够独立承担法律责任。您完成注册程序或其他海龟壹号平台同意的方式实际使用海龟壹号平台服务时，即视为您确认自己具备主体资格，能够独立承担法律责任。若因您不具备主体资格，而导致的一切后果，由您及您的监护人自行承担。除非海龟壹号存在过错外，对于您账户下的所有行为结果（包括但不限于在线签署各类协议/创建推广计划/获取推广代码进行推广等），由您全权承担。
3.您登记的手机号不得侵犯或涉嫌侵犯他人合法权益,否则，海龟壹号有权终止向您提供海龟壹号平台服务、注销您的账户。如给海龟壹号平台带来其他损失或行政调查、诉讼纠纷等，海龟壹号保留进一步追究用户法律责任的权利。账户注销后，相应手机号将不能再注册登记使用。
4.您应谨慎合理保存、使用您的用户名和密码，应对通过您的用户名和密码实施的行为负责。除非有法律规定或司法裁定，且征得海龟壹号的同意，否则，用户名和密码不得以任何方式转让、赠与或继承(与账户相关的财产权益除外)。
5.用户不得将在海龟壹号平台注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。
6. 如果发现任何非法使用等可能危及您的账户安全的情形时，您应当立即以有效方式通知海龟壹号，要求海龟壹号暂停相关服务，并向公安机关报案。您理解海龟壹号对您的请求采取行动需要合理时间，海龟壹号对在采取行动前已经产生的后果(包括但不限于您的任何损失)不承担任何责任。
7.为方便您使用海龟壹号平台服务及海龟壹号关联单位的服务 (以下称“其他服务”)，您同意并授权海龟壹号将您在注册、使用海龟壹号平台服务过程中提供、形成的信息传递给向您提供其他服务的海龟壹号关联单位，或从提供其他服务的海龟壹号关联单位获取您在注册、使用其他服务期间提供、形成的信息。
8.您同意，海龟壹号平台拥有通过邮件、短信电话等形式，向在海龟壹号平台注册、购物用户、收货人发送订单信息、促销活动等告知信息的权利。
9.您了解并同意，海龟壹号有权应国家司法、行政等主管部门的要求，向其提供您在海龟壹号平台填写的注册信息和交易记录等必要信息。如您涉嫌侵犯他人权益行为，则海龟壹号有权在初步判断涉嫌侵权行为存在的情况下，向权利人提供您必要的身份信息。
10.用户同意，海龟壹号有权使用用户的注册信息、用户名、密码等信息， 登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。
五、服务开通与会员权益
1.在您按照海龟壹号要求完成相关注册获得专属账号（即海龟壹号“海王”与“海宝”会员账号），您即成为海龟壹号专属会员，您在本协议项下的各种权限即正式开通。
2.自服务开通之日起五年有效，您可以按照本协议及相关系统的指引使用海龟壹号提供的海龟壹号商城普通经销商服务。
3.服务期满，您如需继续使用本协议项下服务，可按照相关要求和流程办理延期手续。再次延期后，本协议将继续对您有效直至再次期满终止。
4.在购买海龟壹号“海王”及“海宝”会员礼包或商场其他活动礼包后，你有权获得相关权益。
六、行为规范
1.海龟壹号平台上发布交易信息、查询商品和服务信息、达成交易意向并进行交易、参加海龟壹号组织的活动以及使用其它信息服务或技术服务。海龟壹号依照本协议约定为用户开通店铺服务后，用户可使用“海龟壹号平台”发布商品信息，与愿意购买用户商品的其他人员进行在线交流，达成买卖合意，并代表用户向通过“海龟壹号平台”购买商品的人员提供售后服务，同时用户可参与“海龟壹号”相关活动及使用“海龟壹号”同意提供的其他有偿服务。
2.您不得使用“海龟壹号商城普通经销商”账户从事包含下列内容的行为或发布包含下列内容的信息。否则，海龟壹号可对您有关行为或发布的信息依法或依本协议进行删除或屏蔽。
a.传输或发表：煽动抗拒破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权、推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论以及其他任何违反国家法律法规禁止性规定的言论；
b.传输或发表：封建迷信、淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
c.欺诈、虚假或存在误导性的；
d.诋毁海龟壹号或合作商家商誉行为的；
e.侵犯他人知识产权或涉及第三方商业秘密及其他专有权利的；
f.侮辱、诽谤、恐吓和涉及他人隐私等侵害他人合法权益的；
g.跟踪、人肉搜索或以其它方式骚扰他人的；
h.存在可能破坏、篡改、删除、影响海龟壹号商城普通经销商服务正常运行或未经授权秘密获取海龟壹号商城普通经销商服务及其他您的数据、个人资料的病毒、木马、爬虫等恶意软件、程序代码的。或未经合法授权而截获、篡改、收集、储存或删除他人个人信息、站内邮件或其它数据资料，或将获知的此类资料用于任何非法或不正当目的；
i.其他违背法律法规、社会公共利益、公共道德或依据规则规定不适合发布的。
3.不得将在海龟壹号平台（包括海龟壹号网站、手机APP等）下单购买的跨境商品再次进行销售。若您未遵守国家相关法律法规及本协议有关规定的，海龟壹号有权采取暂停您的会员权限、中止或终止您的帐号或本服务之使用（或服务之任何部分）或将您在本服务内任何内容加以移除并删除等措施，并且您须对自己的言论和行为承担法律责任。海龟壹号可对您的违约行为处理措施信息，以及其他经国家行政或司法机关生效法律文书确认的违法信息予以公示。
4.您授权海龟壹号平台自主选择商品供货商、第三方银行监管、仓储物流服务商、客户服务、文案服务、后台收费和支付管理等，您了解海龟壹号平台的运作模式并同意为上述及后续海龟壹号平台提供的各项服务支付服务费。海龟壹号平台保留对残疾人、全日制大学在校学生、贫困人士、海龟壹号平台认可的忠实消费者等实行减免服务费的特殊审批制度。上述人员须递交身份证件、残疾人证(经国家残联统一制发的残疾人专用证件)、 学生证、低保证明、忠实消费者证明(以海龟壹号平台要求为准)等合法有效的证件以及申请说明等材料(具体以海龟壹号平台要求为准)，经过海龟壹号平台审批通过可以享受服务费减免政策，如发现享受减免政策的用户提供的上述资料不合法、不真实、不准确、不详尽或未及时向海龟壹号平台更新其注册资料等的，享受减免政策的用户应承担因此引起的全部责任及后果，海龟壹号保留终止用户使用海龟壹号平台各项服务的权利，如给海龟壹号平台带来其他损失或行政调查、诉讼纠纷等，海龟壹号保留进一步追究用户法律责任的权利。
5.不得利用海龟壹号平台从事窃取商业秘密、窃取个人信息等违法犯罪活动。不得采取不正当竞争行为(包括但不限于从事与海龟壹号平台竞争的行为)，不得扰乱海龟壹号平台交易的正常秩序，不得从事与海龟壹号平台交易无关的行为，不得扰乱海龟壹号平台商品的市场价格。
6.不发布任何侵犯他人及著作权、商标权等知识产权或其他合法权利的内容。
7.不以虚构或歪曲事实的方式不当评价其他用户和或海龟壹号平台。
8.不对海龟壹号平台上的任何数据作商业性利用，包括但不限于在未经海龟壹号事先书面同意的情况下，以复制、传播等任何方式使用海龟壹号平台上展示的资料。不使用任何装置、软件或程序干预海龟壹号平台的正常运营。
9.海龟壹号平台保有删除本平台内各类不符合法律政策或不真实的信息内容而无须通知用户的权利。
10.您同意：若您未遵守以上规定的，海龟壹号平台有权作出独立判断并采取暂停或关闭用户帐号、订单等措施。
11.经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者海龟壹号根据自身的判断，认为您的行为涉嫌违反本协议及或规则的条款或涉嫌违反法律法规规定的，海龟壹号有权在本平台上公示您涉嫌违法或违约行为及海龟壹号已对您采取的措施等。
12.对于您在海龟壹号平台上发布的涉嫌违法或涉嫌侵犯他人和或海龟壹号平台合法权利或违反本协议和或规则的信息，海龟壹号有权不经通知您即予以删除，且按照规则规定进行处罚。
13.对于您在海龟壹号平台上实施的行为，或未在海龟壹号平台上实施但已经对海龟壹号平台及其用户产生影响的行为，海龟壹号有权自行独立认定您行为的性质及是否构成对本协议和或规则的违反，并采取暂停或关闭用户帐号及其他措施。
14.对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保海龟壹号免于因此产生损失或增加费用。
15.如您涉嫌违反有关法律或者本协议之规定，使海龟壹号遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿海龟壹号因此遭受的损失和或发生的费用，包括但不限于合理的诉讼费、律师费等。
七、承诺及保证
1.对于您在注册、激活账户或其他使用海龟壹号商城普通经销商服务过程中提供、形成的除个人信息外的文字、图片、视频、音频等非个人信息，您免费授予海龟壹号及合作商家获得全球许可使用权利及再授权给其他第三方使用的权利。您同意海龟壹号及合作商家存储、使用、复制、修订、编辑、发布、展示、翻译、分发您的非个人信息或制作其派生作品，并以已知或日后开发的形式、媒体或技术将上述信息纳入其它作品内。
2.为方便您使用海龟壹号及其关联公司提供的其他相关服务，您授权海龟壹号将您在注册、激活账户或其他使用海龟壹号商城普通经销商服务过程中提供、形成的信息传递给其他相关服务提供者，或从其他相关服务提供者处获取您在注册、使用相关服务期间提供、形成的信息。
3.如果海龟壹号和或合作单位使用您提供的肖像、姓名或其他合法权益，您同意将您的肖像、姓名和或其他合法权益一并授权给海龟壹号和或合作单位使用。
4.您使用海龟壹号商城普通经销商服务时了解获得的第三方信息，仅可用于您自身的推广目的所需，您不得复制、储存、编辑、公布、出租、出售或以其他方式披露、使用等。第三方信息包括但不限于商品信息数据、交易数据、第三方联系方式等。
5.您同意海龟壹号通过海龟壹号平台公示文案、邮件、短信、电话、海龟壹号商城普通经销商账户等的方式向您送达各类通知。
6.您同意海龟壹号对您海龟壹号商城普通经销商账户的管理权，包含但不限于将保留您所发布内容之最长期间。您也同意，海龟壹号有权依其自行之考虑，不论通知与否，随时变更（包括增加或减少）您海龟壹号商城普通经销商账户权限及使用方式、流程等，具体以届时可实现的为准。海龟壹号会尽可能不断提高、完善您使用海龟壹号商城普通经销商服务的便捷度和友好水平。
7.您了解并同意，本服务及本服务所使用之相关软件（以下简称“软件”）含有受到相关知识产权及其它法律保护之专有保密资料。您也了解并同意，经由本服务或广告商向您呈现之广告或信息所包含之内容，亦受到著作权、商标权、服务商标、专利权或其它专属权利之法律保护。未经海龟壹号或其他有权主体明示授权，您不得修改、出租、出借、出售、散布本服务或软件之任何部份或全部，或据以制作衍生著作，或使用擅自修改后的软件，包括但不限于为了未经授权而使用本服务之目的。海龟壹号仅授予您个人、不可移转及非专属之使用权，使您得于单机计算机使用其软件之目的，但您不得（并不得允许任何第三人）复制、修改、创作衍生著作、进行还原工程、反向组译，或以其它方式发现原始码，或出售、转让、再授权或提供软件设定担保，或以其它方式移转软件之任何权利。您同意将通过由海龟壹号所提供的界面而非任何其它途径使用本服务。
8.海龟壹号商城普通经销商服务所在网站、客户端等各种形态里的法律声明、隐私权政策及规则均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用海龟壹号商城普通经销商服务，视为您同意上述补充协议。
9.您知悉并认可，海龟壹号将按“现状”和“可得到”的状态向您提供海龟壹号商城普通经销商服务。海龟壹号依法律规定承担基础保障义务，但无法对由于信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或因第三方原因而给您造成的损害结果承担责任。
10.您理解，海龟壹号需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成海龟壹号商城普通经销商服务在合理时间内的中断，海龟壹号无需为此承担任何责任，但海龟壹号应尽可能事先进行通告。
11.若您在使用海龟壹号平台时有任何疑惑的问题，您同意以书面文件的形式提出相关问题并亲笔签字后邮寄至平台售后服务中心，平台将根据您提出的问题作出相应处理。
12.您应当保证通过完全合法的自有资金参与海龟壹号平台的相关活动，不得使用任何违法违规资金或极有可能对生活生存产生重大损害的资金参与平台的相关权益活动，由此造成的损失概由您自行承担。
八、订单
1.在海龟壹号平台购物的用户，请您仔细确认所购商品的名称、价格、数量、 型号、规格等信息。因海龟壹号平台展示的商品和价格等信息仅仅是要约邀请，您下单时须完整填写您希望购买的商品数量、价款及支付方式、 收货人、联系方式、收货地址等内容。如果您提供的注册资料等不合法、不真实、不准确、不详尽，用户需承担因此引起的相应责任及后果，并且海龟壹号保留终止用户使用海龟壹号各项服务的权利。
2.系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据， 仅系您向海龟壹号平台发出的合同要约；海龟壹号平台收到您的订单信息后，将订单中的商品从仓库实际向您发出时( 以商品出库为标志)，方视为您与海龟壹号平台之间就实际发出的商品建立了合同关系；如果一份订单里订购了多种商品并且海龟壹号平台只给您发出了部分商品时，您与海龟壹号平台之间仅就实际向您发出的商品建立了合同关系。
3.您了解并同意，海龟壹号平台上的商品、价格、数量、是否有货等商品信息 随时可能发生变动，本平台不作特别通知。由于互联网技术原因导致网页显示信息可能会有一定的滞后性或差错，对此在合同未成立前，您接受本平台在发现网页错误，正式向您发出通知后，对商品信息进行调整，订单按照正确的信息执行，或取消订单。
4.您了解并同意，如您购买商品，发生缺货，您有权取消订单；海龟壹号平台无法保证您提交的订单信息中希望购买的商品都会有货。
5.海龟壹号、海龟壹号关联公司将会把商品(货物)送到您所指定的收货地址。 您了解海龟壹号平台所提示的送货时间供参考，实际送货会与参考时间略有差异。海龟壹号平台管理者和所有者或其关联公司不对因您及收货人原因导致无法送货或延迟送货承担责任。若发生不可抗力或其他正当合理理由导致 发货延迟的，您将给予充分理解。
6.海龟壹号保留在中华人民共和国大陆地区所施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容或取消订单等权利。
7.若您作为海龟壹号平台的经销商，您不得以任何形式进行刷单、囤货而恶意获得平台的相关权益，由此造成的一切损失概由你自行承担。
九、佣金及结算
1.您应获得的佣金比例及结算规则以海龟壹号网站公示或后台系统为准，且海龟壹号有权根据行业及自身业务发展情况单方面调整服务费结算规则及标准并在系统上予以公布，自公布之日起适用新的服务费结算规则及标准，对此您表示理解并予以同意。
2.您为海龟壹号或第三方商家提供推广服务产生的佣金，海龟壹号自营的由海龟壹号的经营主体公司在线向您直接支付；属于第三方商家应付您的佣金由商家承担，并委托系经营公司在线代该第三方商家向您支付。
3.针对您应获取的佣金收益，您依法应缴纳的税费将在结算时由相关付款义务方予以代扣代缴。
4.您在提供服务过程中弄虚作假，如虚假宣传、虚构交易订单等，即使您提供了推广服务，亦无权获得任何佣金。
5.您采取任何措施故意或客观上会使得消费者对海龟壹号产生任何误解或迷惑的（如您试图影响海龟壹号网站任何功能或交易过程的搜索/定购/浏览等）。
6.通过下述方式访问海龟壹号网站的消费者购买而产生的订单,通过经输入一个普通的互联网搜索查询词或关键词后从搜索结果（即是自然的或免费或未付费的搜索结果）所生成或显示的链接，该方式视为您对运营商DNS域名进行劫持。
a.消费者自行访问海龟壹号网站，但您强制消费者跳转到带有您跟踪代码的海龟壹号网站页面，或在海龟壹号网站链接后增加您跟踪代码；
b.将海龟壹号网站网页地址中海龟壹号或任何他方的跟踪代码修改成您自己的跟踪代码；
c.其他消费者未通过您引导到达海龟壹号网站的情形，或您存在违背诚实信用原则行为的情形。

十、协议终止
1. 出现以下情况时，海龟壹号有权直接以注销账户的方式终止本协议。
    a.海龟壹号终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为海龟壹号用户的；
    b.提供的登记手机号不存在或无法接收短信，且没有其他方式可以与您进行联系，或海龟壹号以其它联系方式通知您更改联系方式，而您在海龟壹号通知后三个工作日内仍未更改为有效的手机号的；
    c.您注册信息中的主要内容不真实或不准确或不及时或不完整的；
    d.本协议(含规则)变更时，您明示并通知海龟壹号不愿接受新的服务协议的；
    e.其它海龟壹号认为应当终止服务的情况。
2.您有权向海龟壹号要求注销您的账户，经海龟壹号审核同意的，海龟壹号注销(永久冻结)您的账户。届时，您与海龟壹号基于本协议的合同关系终止。您的账户被注销(永久冻结)后，海龟壹号没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。
3.您同意，您与海龟壹号的合同关系终止后，海龟壹号仍享有下列权利。
a.继续保存您的注册信息及您使用海龟壹号平台服务期间的所有交易信息；
    b.您在使用海龟壹号平台服务期间存在违法行为或违规行为或违反本协议和或规则的行为的，海龟壹号仍可依据本协议向您主张权利。
4.海龟壹号中止或终止向您提供海龟壹号平台服务后，对于您在服务中止或终 止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何损失或增加的任何费用，并应确保海龟壹号免于因此产生任何损失或承担任何费用。
    a.您在服务中止或终止之前已经上传至海龟壹号平台的商品尚未交易的，海龟壹号有权在中止或终止服务的同时删除此项商品的相关信息；
`;